sakura.org
#+TITLE:  Sakura Emacs Configuration
#+AUTHOR: Jonathan Crum
#+EMAIL:  crumja@uga.edu

* Introduction
This document is my personal emacs configuration, written in a [[http://www.orgmode.org][literate style]] to be easier to navigate and explore. Where possible (i.e. where I remember to do so), I include links to documents or configurations that I took inspiration (i.e. unabashedly stole) from.

* General Configuration
These are settings that affect the entire workflow experience in emacs. This includes package management with =use-package=, the keybinding minibuffer with =which-key=, leader bindings with =general=, and so forth.

** Startup
I want to set a few initial options to provide a clean slate to work with.

*** Emacs Daemon
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(server-start)
#+END_SRC

*** Message Control
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq inhibit-startup-message t)
#+END_SRC

*** Deuglification
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq visible-bell t)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
(menu-bar-mode -1)
(set-fringe-mode 10)
#+END_SRC

** Custom File
I definitely don't want to have a bunch of auto-generated code in my config file. Yuck.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq custom-file (concat user-emacs-directory "custom.el"))
(load custom-file 'noerror)
#+END_SRC

** Backups
Sometimes things go sideways on you...

#+begin_src emacs-lisp :tangle "./init.el"
(setq backup-directory-alist `(("." . "~/.saves")))
(setq backup-by-copying t)
(setq delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)
#+end_src

** Basic Information
A little bit of information about me.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq user-full-name "Jonathan Crum")
(setq user-mail-address "crumja@uga.edu")
#+END_SRC

** Path Constants
I use these paths throughout my workflow.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq NOTEBOOK (concat (getenv "HOME") "/Notebook"))
(setq BIBLIOGRAPHY (concat (getenv "HOME") "/texmf/bibtex/bib/master.bib"))
(setq LIBRARY (concat (getenv "HOME") "/Dropbox/Library"))
(setq WORKSPACE (concat (getenv "HOME") "/Workspace"))
#+END_SRC

* Package Loading and Management
This section is for the package management system. It is a standard =use-package= configuration; nothing too interesting here!

** Use-Package
Sakura uses =use-package= to handle downloading and configuring other packages. By default, emacs checks for the presence of =use-package= on launch and, on finding it, downloads and installs whatever it finds.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(require 'package)  ; Initialize package sources
(setq package-archives '(
			 ("melpa" . "https://melpa.org/packages/")
			 ("melpa-stable" . "https://stable.melpa.org/packages/")
			 ("org" . "https://orgmode.org/elpa/")
			 ("elpa" . "https://elpa.gnu.org/packages/")
			 ))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package)
(setq use-package-always-ensure t)
#+END_SRC

** Load Path
*** Custom Elisp
I'll likely want to add custom elisp later on, so let's set that up now.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(push "~/.emacs.d/elisp" load-path)
#+END_SRC

*** External Packages
Sometimes a package isn't on any of the package archives. I'll need to clone them from github and add them manually.

#+begin_src emacs-lisp :tangle "./init.el"
(push "~/.emacs.d/external-packages" load-path)
#+end_src

*** Custom Functions

#+begin_src emacs-lisp
(require 'functions)
#+end_src

** Sakura Packages
*** Package Initialization
#+begin_src emacs-lisp :tangle "./sakura.el"
(defvar sakura-packages nil)

(defmacro sakura/pkg (name &rest body)
  (declare (indent defun))
  (let ((id (if (listp name) (car name) name)))
    `(progn
       (defun ,(intern (format "sakura/init-%s" id)) ()
	 (use-package ,id ,@body))
       (push ',name sakura-packages))))
#+end_src

* Global Configurations
** Keybinding Tools
These packages make keybinding management a looot easier.

*** ESC Cancels All
Very handle little binding to make canceling inputs easier.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC

*** Undo-Tree
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package undo-tree)
(require 'undo-tree)
(global-undo-tree-mode)
#+END_SRC

*** Let's get... Evil
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  (setq evil-respect-visual-line-mode t)
  (setq evil-undo-system 'undo-tree)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line))

(use-package evil-collection
  :after evil
  :custom
  (evil-collection-outline-bind-tab-p nil)
  :config
  (evil-collection-init))

(with-eval-after-load 'evil-maps
  (define-key evil-motion-state-map (kbd "SPC") nil)
  (define-key evil-motion-state-map (kbd "RET") nil)
  (define-key evil-motion-state-map (kbd "TAB") nil))
#+END_SRC

*** Keybinding Panel (which-key)
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0))	; controls how quickly which-key pops up
#+END_SRC

*** Simplify Leader Bindings (general)
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package general
  :config
  (general-evil-setup t)
  (general-create-definer sakura/leader-key-def
			  :keymaps '(normal insert visual emacs)
			  :prefix "SPC"
			  :global-prefix "C-SPC")
  (general-create-definer sakura/ctrl-c-keys
			  :prefix "C-c"))
#+END_SRC

** Toggles
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(sakura/leader-key-def 
  "t" '(:ignore t :which-key "toggles")
  "tt" '(counsel-load-theme :which-key "choose theme"))
#+END_SRC

** Dashboard
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package page-break-lines)
(use-package all-the-icons)
(use-package dashboard
  :ensure t
  :config
  (dashboard-setup-startup-hook)
  (setq dashboard-banner-logo-title "W-welcome to Emacs... I suppose...")
  (setq dashboard-startup-banner "~/.emacs.d/themes/sakura_logo.png"))
#+END_SRC

** Line and Column Numbers
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(column-number-mode)
(global-display-line-numbers-mode -1)
(add-hook 'prog-mode-hook 'linum-mode)
#+END_SRC

** Font Configuration
*** Face Definitions
Fira Code is a fantastic typeface for just about everything.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(set-face-attribute 'default nil 
		    :font "Fira Code Retina"
		    :height 120)

(set-face-attribute 'fixed-pitch nil
		    :font "Fira Code Retina"
		    :height 120)
#+END_SRC

*** Highlight Matching Braces
(Lost (In a (Sea of (Parens...))))

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

*** Highlight Hexadecimal Color Strings
Because it has to be beautiful - also nobody's got time to noodle out hex code conversions.

#+begin_src emacs-lisp :tangle "./init.el"
(use-package rainbow-mode)

(sakura/leader-key-def
  "tr" 'rainbow-mode)
#+end_src

** Modeline
Doom style modeline, for the hotness.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))
#+END_SRC

** EShell Toggle
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package eshell-toggle
  :bind ("C-`" . eshell-toggle)
  :custom
  (eshell-toggle-size-fraction 3)
  (eshell-toggle-use-projectile-root t)
  (eshell-toggle-run-command nil))
#+END_SRC

** File Browsing
*** Better Completions with Ivy
I use Ivy, Counsel, and Swiper to navigate around files, buffer, and projects. Here are some workflow notes that have helped me:

- While in an Ivy minibuffer, you can search within the current results by using =S-Space=.
- To quickly jump to an item in the minibuffer, use =C-'= to get Avy line jump keys.
- To see actions for the selected minibuffer item, use =M-o= and then press the action's key.
- Use =C-c C-o= to open =ivy-occur= which opens the search results within a separate buffer. From there you can click any item to perform the ivy action.

#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package ivy
  :diminish			; suppresses minor mode on modeline
  :bind (("C-s" . swiper)	; allows fuzzy searching within current buffer
	 :map ivy-minibuffer-map
	 ("TAB" . ivy-alt-done)
	 ("C-l" . ivy-alt-done)
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line)
	 :map ivy-switch-buffer-map
	 ("C-k" . ivy-previous-line)
	 ("C-l" . ivy-done)
	 ("C-d" . ivy-switch-buffer-kill)
	 :map ivy-reverse-i-search-map
	 ("C-k" . ivy-previous-line)
	 ("C-d" . ivy-reverse-i-search-kill))
  :config
  (setq ivy-use-selectable-prompt t)
  (ivy-mode 1))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("M-x" . counsel-M-x)
	 ("C-x b" . counsel-ibuffer)
	 ("C-x C-f" . counsel-find-file)
	 :map minibuffer-local-map
	 ("C-r" . 'counsel-minibuffer-history)))

(sakura/leader-key-def
  "SPC" '(counsel-find-file :which-key "find file")) 
#+END_SRC

** Window Management
*** Window Selection (ace-window)
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(use-package ace-window
  :bind (("M-o" . ace-window))
  :config
  (setq aw-keys '(?h ?j ?k ?l)))
#+END_SRC

*** Keybindings
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(sakura/leader-key-def 
  "w" '(:ignore t :which-key "windows")
  "w-" 'split-window-vertically
  "w/" 'split-window-horizontally
  "wd" 'delete-window
  "wh" 'evil-window-left
  "wl" 'evil-window-right
  "wk" 'evil-window-up
  "wj" 'evil-window-down)

(sakura/leader-key-def
  "o" '(:ignore t :which-key "open")
  "of" 'make-frame)
#+END_SRC

** Buffer Management
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(sakura/leader-key-def
  "b" '(:ignore t :which-key "buffer")
  "bb" '(counsel-ibuffer :which-key "switch-to-buffer")
  "bd" '(kill-buffer :which-key "kill-buffer"))
#+END_SRC

** Bookmarks
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(sakura/leader-key-def
  "C-m" '(:ignore t :which-key "bookmarks")
  "C-m n" '(bookmark-set :which-key "bookmark-set")
  "C-m d" '(bookmark-delete :which-key "bookmark-delete")
  "C-m C-m" '(bookmark-bmenu-list :which-key "bookmark-list"))
#+END_SRC

** General Keybindings
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(sakura/leader-key-def
  "n" '(:ignore t :which-key "notebook")
  "nb" '(:ignore t :which-key "bibtex"))
#+END_SRC

* Package Configuration
** Neotree
*** Configuration
#+begin_src emacs-lisp :tangle "./init.el"
(use-package neotree
  :config
  (setq 
   neo-theme (if (display-graphic-p) 'icons 'arrow)
   neo-window-fixed-size nil
   neo-window-width 15
   )
  :init
  (add-hook 'neo-after-create-hook (lambda (&rest _) (display-line-numbers-mode -1))))
#+end_src

*** Keybindings
#+begin_src emacs-lisp :tangle "./init.el"
(sakura/leader-key-def
  "t`" '(neotree-toggle :which-key "neotree"))
#+end_src

** Org-Mode
*** General Configuration
I have uh... a lot going on in here.

#+begin_src emacs-lisp :tangle "./init.el"
(defun sakura/org-mode-setup ()
  (org-indent-mode)
  (auto-fill-mode 0)
  (visual-line-mode 1)
  (setq evil-auto-indent nil))
#+end_src

#+begin_src emacs-lisp :tangle "./init.el"
(use-package org
  :defer t
  :hook (org-mode . sakura/org-mode-setup)
  :config
  (setq 
   org-hide-emphasis-markers t
   org-src-fontify-natively t
   org-src-tab-acts-natively t
   org-edit-src-content-indentation 0
   org-hide-block-startup nil
   org-src-preserve-indentation nil
   org-startup-folded t
   org-cycle-separator-lines 2
   org-directory NOTEBOOK
   org-return-follows-link t
   org-support-shift-select t
   org-agenda-files '("~/Notebook/index.org")
   org-refile-targets '(
			(org-agenda-files :maxlevel . 3)
			(org-agenda-files :maxlevel . 3))
   org-outline-path-complete-in-steps nil
   org-refile-use-outline-path t
   org-todo-keywords '(
		       (sequence "TODO" "|" "DONE")
		       (sequence "DOING" "PAUSED" "CANCELLED")
		       (sequence "NOTE" "PROJECT" "|" "TO ARCHIVE"))
   org-capture-templates '(
			   ("n" "Note" entry (file+headline "~/Notebook/index.org" "INBOX")
			    "* NOTE  %?\n" :empty-lines 1)
			   ("t" "Teaching" entry (file+headline "~/Notebook/index.org" "TEACHING")
			    "* TODO  %?\n" :empty-lines 1)
			   ("p" "Project" entry (file+headline "~/Notebook/index.org" "PROJECTS")
			    "* TODO  %?\n" :empty-lines 1)
			   ("b" "Bib Entry" entry (file+headline "~/Notebook/index.org" "RESEARCH")
			    "*  %?\n" :empty-lines 1)
			   ("o" "Link capture" entry (file+headline "~/Notebook/index.org" "WEB BOOKMARKS")
			    "* %a %U" :immediate-finish t))
   org-protocol-default-template-key "o"
   org-format-latex-options (plist-put org-format-latex-options :scale 1.6))
  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-j") 'org-next-visible-heading)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "C-k") 'org-previous-visible-heading)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "M-j") 'org-metadown)
  (evil-define-key '(normal insert visual) org-mode-map (kbd "M-k") 'org-metaup))
#+end_src

*** Keybindings
#+begin_src emacs-lisp :tangle "./init.el"
(sakura/leader-key-def
  "l" '(:ignore t :which-key "links")
  "ll" '(org-store-link :which-key "org-store-link")
  "li" '(org-insert-link :which-key "org-insert-link")
  "lI" '(org-insert-all-links :which-key "org-insert-all-links")
  "c"  '(:ignore t :which-key "capture")
  "cc" '(org-capture :which-key "org-capture"))
#+end_src

*** Org-Agenda
**** Basic Setup
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq org-agenda-format-date 
      (lambda (date) (concat "\n"
			     (make-string (window-width) 9472)
			     "\n"
			     (org-agenda-format-date-aligned date))))
#+END_SRC

**** Agenda Views
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(setq org-agenda-custom-commands
      '(("c" "Simple agenda view"
	 ((tags "PRIORITY=\"A\""
		((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
		 (org-agenda-overriding-header "High-priority unfinished tasks:")))
	  (agenda "" ((org-agenda-ndays 1)))
	  (alltodo ""
		   ((org-agenda-skip-function '(or
						(sakura/org-skip-subtree-if-habit)
						(sakura/org-skip-subtree-if-priority ?A)
						(org-agenda-skip-if nil '(scheduled deadline))))
		    (org-agenda-overridding-header "\n\nALL normal priority tasks:"))))
	 ((org-agenda-block-separator "------------------------------------------")))))
#+END_SRC

**** Custom Function Definitions
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(defun sakura/org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.

PRIORITY may be one of the characters ?A, ?B or ?C."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
	(pri-value (* 1000 (- org-lowest-priority priority)))
	(pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
	subtree-end
      nil)))
		   
(defun sakura/org-skip-subtree-if-habit ()
  "Skip an agenda entry if it has a style property equal to \"habit\"."
  (let ((subtree-end (save-excursion (org-end-of-subtree t))))
    (if (string= (org-entry-get nil "STYLE") "habit")
	subtree-end
      nil)))
#+END_SRC

**** Keybindings
#+BEGIN_SRC emacs-lisp :tangle "./init.el"
(sakura/leader-key-def
  "na" '(org-agenda :which-key "agenda"))
#+END_SRC

