sakura.org
*** Theme Definitions
#+BEGIN_SRC emacs-lisp :tangle "./themes/doom-sakura-light-theme.el"
(defgroup doom-sakura-light-theme nil
  "Options for doom-themes"
  :group 'doom-themes)

(defcustom doom-sakura-brighter-modeline nil
  "If non-nil, more vivid colors will be used to style the mode-line."
  :group 'doom-sakura-light-theme
  :type 'boolean)

(defcustom doom-sakura-brighter-comments nil
  "If non-nil, comments will be highlighted in more vivid colors."
  :group 'doom-sakura-light-theme
  :type 'boolean)

(defcustom doom-sakura-comment-bg doom-sakura-brighter-comments
  "If non-nil, comments will have a subtler, darker background, enhancing legibility."
  :group 'doom-sakura-light-theme
  :type 'boolean)

;; (def-doom-theme NAME DOCSTRING DEFS &optional EXTRA-FACES EXTRA-VARS)
(def-doom-theme 
  doom-sakura-light
  "A pleasant light theme, soft as a cherry blossom."

  ;; name           default     256         16
  ( (bg           '("#FBF7EF"   "#FBF7EF"   "white"))
    (bg-alt       '("#E2D8F5"   "#E2D8F5"   "white"))
    (base0        '("#363636"   "#363636"   "black"))
    (base1        '("#414141"   "#414141"   nil))
    (base2        '("#BF9B9F"   "#BF9B9F"   nil))
    (base3        '("#EBE6EA"   "#EBE6EA"   nil)) ;; block highlights
    (base4        '("#C9678D"   "#C9678D"   nil))
    (base5        '("#ECA7D5"   "#ECA7D5"   nil))
    (base6        '("#C9678D"   "#C9678D"   nil))
    (base7        '("#E7CEEE"   "#E7CEEE"   nil))
    (base8        '("#E2D8F5"   "#E2D8F5"   nil))
    (fg           '("#2A2A2A"   "#2A2A2A"   nil))
    (fg-alt       '("#2A2A2A"   "#2A2A2A"   nil))

    (grey base6)
    (red          '("#BE3445"   "#BE3445"   nil))
    (orange       '("#D36745"   "#D36745"   nil))     
    (green        '("#768E42"   "#BE3445"   nil))
    (yellow       '("#C38913"   "#E1B967"   nil))
    (magenta      '("#CE67CF"   "#CE67CF"   nil))

    (teal         '("#29838D"   "#29838D"   nil))
    (blue         '("#3B6EA8"   "#3B6EA8"   nil))
    (dark-blue    '("#5272AF"   "#5272AF"   nil))
    (violet       '("#842879"   "#842879"   nil))
    (cyan         '("#398EAC"   "#398EAC"   nil))
    (dark-cyan    '("#2C7088"   "#2C7088"   nil))
    (iosvkem-bg   '("#1b1d1e"   "#1b1d1e"   nil))
    (iosvkem-bga  '("#262829"   "#262829"   nil))
    ;; I can add arbitrarily many more definitions :o

    ;; face categories -- required for all themes
    (highlight          (doom-blend red bg 0.95))
    (vertical-bar       (doom-darken bg 0.15))
    (selection          (doom-blend base5 bg 0.75))
    (builtin            teal)
    (comments           (doom-darken base5 0.45))
    (doc-comments       (doom-darken base5 0.45))
    (constants          magenta)
    (functions          teal)
    (keywords           blue)
    (methods            teal)
    (operators          blue)
    (type               yellow)
    (strings            green)
    (variables          violet)
    (numbers            magenta)
    (region             `(,(doom-lighten (car base5) 0.15) ,@(doom-lighten (cdr base0) 0.15)))
    (error              red)
    (warning            yellow)
    (success            green)
    (vc-modified        orange)
    (vc-added           green)
    (vc-deleted         red)
    (hl-line            (doom-blend base5 bg 0.5))
    (cursor-color       '("#000000"))
    (+evil--default-cursor-color '("#000000"))
    (modeline-fg        nil))

  ;; EXTRA-FACES
  (
   ((outline-1 &override)  :foreground base0 :weight 'normal)
   ((outline-2 &override)  :foreground base0 :weight 'normal)
   ((outline-3 &override)  :foreground base0 :weight 'normal)
   ((outline-4 &override)  :foreground base0 :weight 'normal)
   ((outline-5 &override)  :foreground base0 :weight 'normal)
   ((outline-6 &override)  :foreground base0 :weight 'normal)
   ((outline-7 &override)  :foreground base0 :weight 'normal)
   ((outline-8 &override)  :foreground base0 :weight 'normal)

   ((org-block &override) 
    :inherit 'fixed-pitch)

   ((org-verbatim &override) 
    :foreground red 
    :background nil 
    :weight 'normal)

   ((org-table &override) 
    :background bg)

   ((org-formula &override) 
    :background bg)

   ((org-ref-cite-face &override) 
    :foreground red)

   ((org-drawer &override) 
    :foreground "#9F9F9F")

   ((org-block-begin-line &override) 
 ;;   :inherit 'fixed-pitch
    :foreground base2 
    :background nil 
    :underline fg)

   ((org-block-end-line &override) 
 ;;   :inherit 'fixed-pitch
    :foreground base2 
    :background nil 
    :underline nil 
    :overline fg)

   ((org-document-info-keyword &override) 
    :foreground base2)

   ((ivy-current-match &override) 
    :foreground fg)
   
   ((org-link &override)
    :foreground red
    :background nil
    :underline red)
   ) 

  ;; EXTRA-VARS
  ())
#+END_SRC

*** Python Font-Lock Adjustments
#+begin_src emacs-lisp :tangle "./init.el"
(defvar font-lock-operator-face 'font-lock-operator-face)

(defface font-lock-operator-face
  '((((type tty) (class color)) nil)
    (((class color) (background light))
     (:foreground "dark red"))
    (t nil))
  "Used for operators."
  :group 'font-lock-faces)

(defvar font-lock-operator-keywords
  '(("\\([][|!.+=&/%*,<>(){}:^~-]+\\)" 1 font-lock-operator-face)))

(add-hook 'python-mode-hook 
	  '(lambda ()
	     (font-lock-add-keywords nil font-lock-operator-keywords t))
	  t t)
#+end_src

** Dark Theme
This is my custom dark theme. This is still a work-in-progress, but it will be tailored as a complement to my light theme.

*** Theme Definitions
#+begin_src emacs-lisp :tangle "./themes/doom-sakura-dark-theme.el"
(defgroup doom-sakura-dark-theme nil
  "Options for doom themes."
  :group 'doom-themes)

 (def-doom-theme doom-sakura-dark
   "A soothing dark theme, tranquil as a warm evening breeze."

   ()
   ()
   ())

#+end_src

** Other Theming
*** Font Locks
#+begin_src emacs-lisp :tangle "./init.el"
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
			   (0 (prog1 () 
				(compose-region (match-beginning 1) (match-end 1)"•"))))))
#+end_src

*** Blink Cursor
This is kind of fun - rather than a static cursor, this function makes it change colors every time it blinks. When not in insert-mode, the color blinking of the block cursor is especially nice.

#+begin_src emacs-lisp :tangle "./init.el"
(defvar blink-cursor-colors (list  "#92c48f" "#6785c5" "#be369c" "#d9ca65")
  "On each blink the cursor will cycle to the next color in this list.")

(setq blink-cursor-count 0)
(defun blink-cursor-timer-function ()
  "Zarza wrote this cyberpunk variant of timer `blink-cursor-timer'. 
Warning: overwrites original version in `frame.el'.

This one changes the cursor color on each blink. Define colors in `blink-cursor-colors'."
  (when (not (internal-show-cursor-p))
    (when (>= blink-cursor-count (length blink-cursor-colors))
      (setq blink-cursor-count 0))
    (set-cursor-color (nth blink-cursor-count blink-cursor-colors))
    (setq blink-cursor-count (+ 1 blink-cursor-count))
    )
  (internal-show-cursor nil (not (internal-show-cursor-p))))
#+end_src

*** Frame Alpha
Many of my windows have a slightly decreased opacity; for some reason, my compositor doesn't like to touch my emacs (the LISP must scare it?) so we can just set it manually here. No worries.

#+begin_src emacs-lisp :tangle "./init.el"
(set-frame-parameter (selected-frame) 'alpha '(85 85))
(add-to-list 'default-frame-alist '(alpha 85 85))
#+end_src

*** Tab Line
**** Tab-Line-Mode
#+begin_src emacs-lisp :tangle "./init.el"
(global-tab-line-mode)

(defun sakura/light-theme-tab-line ()
  (set-face-attribute 'tab-line nil 
		      ;; background behind tabs
		      :background "#E2D8F5"
		      :foreground "black" :distant-foreground "black"
		      :family "Fira Sans Condensed" :height 1.0 :box nil)

  (set-face-attribute 'tab-line-tab nil 
		      ;; active tab in other window
		      :inherit 'tab-line
		      :foreground "#FBF7EF" :background "#FBF7EF" :box nil)

  (set-face-attribute 'tab-line-tab-current nil 
		      ;; active tab in current window
		      :background "#FBF7EF" :foreground "#2A2A2A" :box nil)

  (set-face-attribute 'tab-line-tab-inactive nil
		      ;; inactive tab
		      :background "#E2D8F5" :foreground "#5A5A5A" :box nil)

  (set-face-attribute 'tab-line-highlight nil
		      ;; mouseover
		      :background "#ECA7D5" :foreground 'unspecified))

(defun sakura/dark-theme-tab-line ()
  (set-face-attribute 'tab-line nil 
		      ;; background behind tabs
		      :background "#2A2A2A"
		      :foreground "black" :distant-foreground "black"
		      :family "Fira Sans Condensed" :height 1.0 :box nil)

  (set-face-attribute 'tab-line-tab nil 
		      ;; active tab in other window
		      :inherit 'tab-line
		      :foreground "#2A2A2A" :background "#2A2A2A" :box nil)

  (set-face-attribute 'tab-line-tab-current nil 
		      ;; active tab in current window
		      :background "#2A2A2A" :foreground "#FBF7EF" :box nil)

  (set-face-attribute 'tab-line-tab-inactive nil
		      ;; inactive tab
		      :background "#5A5A5A" :foreground "#E2D8F5" :box nil)

  (set-face-attribute 'tab-line-highlight nil
		      ;; mouseover
		      :background "#ECA7D5" :foreground 'unspecified))

(defun sakura/tab-line-dark-theme ()
  (global-tab-line-mode)
  (sakura/dark-theme-tab-line)
  (global-tab-line-mode))

(defun sakura/tab-line-light-theme ()
  (global-tab-line-mode)
  (sakura/light-theme-tab-line)
  (global-tab-line-mode))

(sakura/tab-line-light-theme)

(sakura/leader-key-def
  "C-i"   '(:ignore t :which-key "Tab Navigation")
  "C-i j" '(tab-line-switch-to-prev-tab :which-key "Previous Tab")
  "C-i h" '(tab-line-switch-to-prev-tab :which-key "Previous Tab")
  "C-i l" '(tab-line-switch-to-next-tab :which-key "Next Tab")
  "C-i k" '(tab-line-switch-to-next-tab :which-key "Next Tab"))
#+end_src

**** Powerline
#+begin_src emacs-lisp :tangle "./init.el"
(use-package powerline)
(require 'powerline)
(defvar sakura/tab-height 22)
(defvar sakura/tab-left (powerline-wave-right 'tab-line nil sakura/tab-height))
(defvar sakura/tab-right (powerline-wave-left nil 'tab-line sakura/tab-height))

(defun sakura/tab-line-tab-name-buffer (buffer &optional _buffers)
  (powerline-render (list sakura/tab-left
			  (format " %s  " (buffer-name buffer))
			  sakura/tab-right)))

(setq tab-line-tab-name-function #'sakura/tab-line-tab-name-buffer)
(setq tab-line-new-button-show nil)
(setq tab-line-close-button-show nil)

#+end_src

* Inspirations
- [[https://github.com/howardabrams/dot-files][Howard Abrams]]
- [[https://github.com/daedreth/UncleDavesEmacs/blob/master/config.org][Uncle Daves Emacs]]
- [[https://github.com/dakrone/dakrone-dotfiles/blob/master/emacs.org][Dakrone]]
- [[https://github.com/jinnovation/dotemacs][Jinnovation]]
- [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][Daviwil]]
- [[https://writequit.org/org/][Writequit]]
- [[https://doc.rix.si/cce/cce.html][Complete Computing Environment]]
- [[http://ivanmalison.github.io/dotfiles/#about][Ivan Malison]]
  Malison is the creator of Org-Projectile!
